; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-12)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 )
(:init
(arm-empty)
(on-table b1)
(on b2 b11)
(on-table b3)
(on b4 b12)
(on b5 b3)
(on b6 b4)
(on b7 b2)
(on b8 b5)
(on b9 b1)
(on-table b10)
(on b11 b8)
(on b12 b10)
(clear b6)
(clear b7)
(clear b9)
)
(:goal
(and
(on b1 b7)
(on b3 b9)
(on b4 b1)
(on b5 b6)
(on b6 b11)
(on b7 b2)
(on b9 b5)
(on b10 b12)
(on b11 b10)
(on b12 b4))
)
)

; plan
1. (unstack b7 b2)
   deleted: (on b7 b2) (clear b7) (arm-empty)
   added: (holding b7) (clear b2)
   goals met: 0 of 10
2. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 10
3. (unstack b2 b11)
   deleted: (on b2 b11) (clear b2) (arm-empty)
   added: (holding b2) (clear b11)
   goals met: 0 of 10
4. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 10
5. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 0 of 10
6. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 1 of 10
7. (unstack b9 b1)
   deleted: (on b9 b1) (clear b9) (arm-empty)
   added: (holding b9) (clear b1)
   goals met: 1 of 10
8. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 10
9. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 1 of 10
10. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 2 of 10
11. (unstack b6 b4)
   deleted: (on b6 b4) (clear b6) (arm-empty)
   added: (holding b6) (clear b4)
   goals met: 2 of 10
12. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 10
13. (unstack b4 b12)
   deleted: (on b4 b12) (clear b4) (arm-empty)
   added: (holding b4) (clear b12)
   goals met: 2 of 10
14. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 3 of 10
15. (unstack b12 b10)
   deleted: (on b12 b10) (clear b12) (arm-empty)
   added: (holding b12) (clear b10)
   goals met: 3 of 10
16. (stack b12 b4)
   deleted: (clear b4) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b4)
   goals met: 4 of 10
17. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 4 of 10
18. (stack b10 b12)
   deleted: (clear b12) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b12)
   goals met: 5 of 10
19. (unstack b11 b8)
   deleted: (on b11 b8) (clear b11) (arm-empty)
   added: (holding b11) (clear b8)
   goals met: 5 of 10
20. (stack b11 b10)
   deleted: (clear b10) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b10)
   goals met: 6 of 10
21. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 6 of 10
22. (stack b6 b11)
   deleted: (clear b11) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b11)
   goals met: 7 of 10
23. (unstack b8 b5)
   deleted: (on b8 b5) (clear b8) (arm-empty)
   added: (holding b8) (clear b5)
   goals met: 7 of 10
24. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 7 of 10
25. (unstack b5 b3)
   deleted: (on b5 b3) (clear b5) (arm-empty)
   added: (holding b5) (clear b3)
   goals met: 7 of 10
26. (stack b5 b6)
   deleted: (clear b6) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b6)
   goals met: 8 of 10
27. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 8 of 10
28. (stack b9 b5)
   deleted: (clear b5) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b5)
   goals met: 9 of 10
29. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 9 of 10
30. (stack b3 b9)
   deleted: (clear b9) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b9)
   goals met: 10 of 10
